In [9]:
import pandas as pd
import json

In [10]:
dfsuburbs = pd.read_csv("lga_suburbs.csv")

In [11]:
dfsuburbs.head()

   lga_id              suburb
0       1             ivanhoe
1       1        ivanhoe east
2       1           bellfield
3       1  heidelberg heights
4       1     heidelberg west

In [12]:
dflga = pd.read_csv("local_govt_areas.csv")

In [13]:
dflga.head()

   lga_id    lga_name
0       1     banyule
1       2     bayside
2       3  boroondara
3       4    brimbank
4       5    cardinia

In [14]:
result = pd.merge(dfsuburbs, dflga, on="lga_id")
result.head()

   lga_id              suburb lga_name
0       1             ivanhoe  banyule
1       1        ivanhoe east  banyule
2       1           bellfield  banyule
3       1  heidelberg heights  banyule
4       1     heidelberg west  banyule

In [15]:
merged = result.drop(["lga_id"], axis=1)
merged.head()

               suburb lga_name
0             ivanhoe  banyule
1        ivanhoe east  banyule
2           bellfield  banyule
3  heidelberg heights  banyule
4     heidelberg west  banyule

In [19]:
merged.set_index("lga_name")

                          suburb
lga_name
banyule                  ivanhoe
banyule             ivanhoe east
banyule                bellfield
banyule       heidelberg heights
banyule          heidelberg west
...                          ...
yarra ranges         ferny creek
yarra ranges          sherbrooke
yarra ranges            kallista
yarra ranges           the patch
yarra ranges        mount evelyn

[313 rows x 1 columns]

In [21]:
merged.to_json("suburbs_lga.json", orient = "records")

In [ ]:
merged